NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series1/EFM32GG11B/EFM32GG11B840F1024GL152.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>ETH</name>
      <description>ETH</description>
      <baseAddress>0x40024000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>ETH</name>
        <value>59</value>
      </interrupt>
      <registers>
        <register>
          <name>NETWORKCTRL</name>
          <description>Network control register</description>
          <addressOffset>0x000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x035F9FFE</resetMask>
          <fields>
            <field>
              <name>LOOPBACKLOCAL</name>
              <description>Loopback local</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENBRX</name>
              <description>Receive enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENBTX</name>
              <description>Transmit enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MANPORTEN</name>
              <description>Management port enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLRALLSTATSREGS</name>
              <description>Clear statistics registers</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INCALLSTATSREGS</name>
              <description>Incremental statistics registers</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STATSWREN</name>
              <description>Write enable for statistics registers</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACKPRESSURE</name>
              <description>Back pressure will force collisions on all received frames</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXSTRT</name>
              <description>Start transmission</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXHALT</name>
              <description>Transmit halt</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXPFRMREQ</name>
              <description>Transmit pause frame </description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXPFRMZERO</name>
              <description>Transmit zero quantum pause frame </description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STORERXTS</name>
              <description>Store receive time stamp to memory.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PFCENB</name>
              <description>Enable PFC Priority Based Pause Reception capabilities.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXPFCPRIORPFRM</name>
              <description>Write a one to transmit PFC priority based pause frame.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLUSHRXPKT</name>
              <description>Flush the next packet from the external RX DPRAM.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXLPIEN</name>
              <description>Enable LPI transmission when set LPI (low power idle) is immediately transmitted.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PTPUNICASTEN</name>
              <description>Enable detection of unicast PTP unicast frames.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STOREUDPOFFSET</name>
              <description>Store UDP / TCP offset to memory.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ONESTEPSYNCMODE</name>
              <description>1588 One Step Sync Mode. </description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PFCCTRL</name>
              <description>Enable multiple PFC pause quantums, one per pause priority</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NETWORKCFG</name>
          <description>Network configuration register</description>
          <addressOffset>0x004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00080000</resetValue>
          <resetMask>0x779FF1FF</resetMask>
          <fields>
            <field>
              <name>SPEED</name>
              <description>Speed</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FULLDUPLEX</name>
              <description>Full duplex</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DISCRDNONVLANFRAMES</name>
              <description>Discard non-VLAN frames </description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>JUMBOFRAMES</name>
              <description>Jumbo frames enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COPYALLFRAMES</name>
              <description>Copy all frames</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NOBROADCAST</name>
              <description>No broadcast</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MULTICASTHASHEN</name>
              <description>Multicast hash enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UNICASTHASHEN</name>
              <description>Unicast hash enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX1536BYTEFRAMES</name>
              <description>Receive 1536 byte frames</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RETRYTEST</name>
              <description>Retry test</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAUSEEN</name>
              <description>Pause enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXBUFFOFFSET</name>
              <description>Receive buffer offset</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LENFIELDERRFRMDISCRD</name>
              <description>Length field error frame discard</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FCSREMOVE</name>
              <description>FCS remove</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MDCCLKDIV</name>
              <description>MDC clock division</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIVBY8</name>
                  <description>divide HFBUSCLKETH by 8 (HFBUSCLKETH up to 20 MHz)</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVBY16</name>
                  <description>divide HFBUSCLKETH by 16 (HFBUSCLKETH up to 40 MHz)</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVBY32</name>
                  <description>divide HFBUSCLKETH by 32 (HFBUSCLKETH up to 80 MHz)</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVBY48</name>
                  <description>divide HFBUSCLKETH by 48 (HFBUSCLKETH up to 120 MHz)</description>
                  <value>0x00000003</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVBY64</name>
                  <description>divide HFBUSCLKETH by 64 (HFBUSCLKETH up to 160 MHz)</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVBY96</name>
                  <description>divide HFBUSCLKETH by 96 (HFBUSCLKETH up to 240 MHz)</description>
                  <value>0x00000005</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVBY128</name>
                  <description>divide HFBUSCLKETH by 128 (HFBUSCLKETH up to 320 MHz)</description>
                  <value>0x00000006</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVBY224</name>
                  <description>divide HFBUSCLKETH by 224 (HFBUSCLKETH up to 540 MHz)</description>
                  <value>0x00000007</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISCOPYOFPFRAMES</name>
              <description>Disable copy of pause frames</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXCHKSUMOFFLOADEN</name>
              <description>Receive checksum offload enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENHALFDUPLEXRX</name>
              <description>Enable frames to be received in half-duplex mode while transmitting.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IGNORERXFCS</name>
              <description>Ignore RX FCS</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IPGSTRTCHEN</name>
              <description>IPG stretch enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NSPCHANGE</name>
              <description>Receive bad preamble.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IGNOREIPGRXER</name>
              <description>Ignore IPG rx_er.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NETWORKSTATUS</name>
          <description>Network status register </description>
          <addressOffset>0x008</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000004</resetValue>
          <resetMask>0x000000C6</resetMask>
          <fields>
            <field>
              <name>MDIOIN</name>
              <description>Returns status of the mdio_in pin.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MANDONE</name>
              <description>The PHY management logic is idle (i.e. has completed).</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PFCNEGOTIATE</name>
              <description>Set when PFC Priority Based Pause has been negotiated.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LPIINDICATE</name>
              <description>LPI Indication</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACFG</name>
          <description>DMA Configuration Register</description>
          <addressOffset>0x010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00020704</resetValue>
          <resetMask>0x37FF1F3F</resetMask>
          <fields>
            <field>
              <name>AMBABRSTLEN</name>
              <description>Selects the burst length to use on the AMBA (AHB) when transferring frame data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HDRDATASPLITEN</name>
              <description>Enable header data Splitting.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXPBUFSIZE</name>
              <description>Receiver packet buffer memory size select.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SIZE0</name>
                  <description>Do not use top three address bits (0.5 Kb)</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE1</name>
                  <description>Do not use top two address bits (1 Kb)</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE2</name>
                  <description>Do not use top address bit (2 Kb)</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE3</name>
                  <description>Use full configured addressable space (4 Kb)</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXPBUFSIZE</name>
              <description>Transmitter packet buffer memory size select.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXPBUFTCPEN</name>
              <description>Transmitter IP, TCP and UDP checksum generation offload enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INFLASTDBUFSIZEEN</name>
              <description>Forces the DMA</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXBUFSIZE</name>
              <description>DMA receive buffer size in external AMBA (AHB) system memory.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRCDISCARDONERR</name>
              <description>Auto Discard RX pkts during lack of resource.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRCMAXAMBABRSTRX</name>
              <description>Force max length bursts on RX.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRCMAXAMBABRSTTX</name>
              <description>Force max length bursts on TX.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXBDEXTNDMODEEN</name>
              <description>Enable RX extended BD mode.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXBDEXTENDMODEEN</name>
              <description>Enable TX extended BD mode.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXSTATUS</name>
          <description>Transmit status register</description>
          <addressOffset>0x014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000001FF</resetMask>
          <fields>
            <field>
              <name>USEDBITREAD</name>
              <description>Used bit read</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COLOCCRD</name>
              <description>Collision occurred</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RETRYLMTEXCD</name>
              <description>Retry limit exceeded</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXGO</name>
              <description>Transmit go</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AMBAERR</name>
              <description>Transmit frame corruption due to AMBA (AHB) errors.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXCMPLT</name>
              <description>Transmit complete</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXUNDERRUN</name>
              <description>Transmit under run</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LATECOLOCCRD</name>
              <description>Late collision occurred</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESPNOTOK</name>
              <description>bresp/hresp not OK</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
